Repository: polswert12/decibels_polish
Catalog: po/*.po
Languages: pl

source: Audio Player
pl: Odtwarzacz Audio

source: music;player;media;audio;
pl: muzyka;odtwarzacz;media;audio;

source: Play audio files
pl: Odtwarzaj pliki audio

source: Current features:
pl: Obecne funkcje:

source: Shows the waveform of the track
pl: Pokazuje przebieg ścieżki

source: Adjust playback speed
pl: Dostosuj szybkość odtwarzania

source: Easy seek controls
pl: Łatwa kontrola

source: Decibels joined GNOME Circle! 🥳
pl: Decibels dołączyły do GNOME Circle! 🥳

source: Enhanced the accessibility of the app by ensuring that every on-screen element is screenreader accessible
pl: Zwiększono dostępność aplikacji, zapewniając, że każdy element na ekranie jest dostępny dla czytnika ekranu

source: Added Dutch, Occitan, Belarusian and updated the Italian translations
pl: Dodano język niderlandzki, oksytański, białoruski i zaktualizowano tłumaczenia włoskie

source: The buttons allowing to skip forwards and backwards 30 seconds were removed
pl: Przyciski umożliwiające przewinięcie 30 sekund w przód i tył zostały usunięte

source: Some issues in the Brazilian Translation were fixed
pl: Kilka błędów w Brazylijskim tłumaczeniu zostało naprawionych

source: The waveform of the track is now reliably generated, and shows volume levels more distinctly
pl: Przebieg ścieżki jest teraz generowany niezawodnie i wyraźniej pokazuje poziomy głośności

source: A few issues preventing some content from being translated were fixed
pl: Błędy związane z nieprzetłumaczonym tekstem zostały naprawione

source: Decibels was translated to Czech, Kinyarwanda, German, Traditional Chinese, Ukrainian and Brazilian Portuguese
pl: Decibels przetłumaczono na język czeski, kinyarwanda, niemiecki, chiński tradycyjny, ukraiński i brazylijski portugalski

source: A small bugfix and minor improvements release
pl: Małe poprawki i ulepszenia

source: The artist of the currently playing track is shown if the artist is known
pl: Artysta obecnie grającego utworu jest pokazywany, jeśli jest podany

source: Fix a minor visual issue when dropping a file
pl: Naprawiono błąd wizualny kiedy przeciągasz plik

source: Pause the track after playback ends
pl: Zapauzuj utwór po tym jak sie skończy

source: The window size is now correctly saved and restored
pl: Rozmiar okna został teraz poprawnie zapisany i przywrócony

source: Decibels was translated to French, Russian, Italian and Turkish
pl: Decibels zostało przetłumaczone na język francuski, rosyjski, włoski i turecki

source: A few improvements and papercut fixes
pl: Kilka ulepszeń

source: Support drag and drop
pl: Wsparcie dla przeciągania plików

source: Seek to the start of a track after it ends
pl: Wróć na początek utworu jak się skończy

source: Allow dragging the app window from everywhere (except the waveform)
pl: Zezwalaj na przeciąganie okna aplikacji zewsząd (z wyjątkiem przebiegu)

source: Made the playback speed popover look less cluttered by removing the +/- buttons and mark labels
pl: Sprawiliśmy, że wyskakujące okienko prędkości odtwarzania wyglądało na mniej zaśmiecone, usuwając +/- przyciski i etykiety z oznaczeniami

source: Fix an issue that prevented accessing file metadata from within the Flatpak sandbox
pl: Naprawiono błąd który nie pozwalał na odczytanie metadanych pliku w Flatpakowej wersji

source: Don't try to play files without audio streams (images and videos without sound)
pl: Nie próbuj odtwarzać plików bez audio (zdjęcia oraz filmy bez dźwięku)

source: Don't try to process video streams even if they were not rendered
pl: Nie próbuj przetwarzać strumieni wideo, nawet jeśli nie zostały wyrenderowane

source: Fixed some issues with the Development build of Decibels
pl: Naprawiono trochę błędów związanych z wersją rozwojową

source: Fixed a minor glitch with the app icon
pl: Naprawiono mały błąd związany z ikonką aplikacji

source: A few bug fixes that polishes up the app
pl: Kilka napraw błędów które poprawiają aplikację

source: Differentiate development versions of the app from the stable app by styling the icon and header differently
pl: Dodano link do donateów w metadanych aplikacji

source: Fix the About Window being detached from main window
pl: Naprawiono, że okienko informacyjne było odczepione od głównego

source: Fix the About Window showing release notes for an older version
pl: Naprawiono okienko informacyjne, które pokazywało informacje dla starszej wersji

source: Drop an audio file to play it
pl: Przeciągnij i upuść plik audio żeby go odtworzyć

source: Open an Audio File
pl: Otwórz plik audio

source: _Open…
pl: _Otwórz…

source: File Cannot Be Played
pl: Plik nie mógł zostać odtworzony

source: _Try Again…
pl: _Spróbuj Ponownie…

source: Main Menu
pl: Główne Menu

source: Open…
pl: Otwórz…

source: _Keyboard Shortcuts
pl: _Skróty Klawiszy

source: _About Decibels
pl: _O Decibels

source: Adjust Playback Speed
pl: Dostosuj szybkość odtwarzania

source: Skip back 10s
pl: Przewiń 10 sekund do tyłu

source: Skip forward 10s
pl: Przewiń 10 sekund do przodu

# shortcut window
source: General
pl: Ogólne

# shortcut window
source: Show Shortcuts
pl: Pokaż skróty

# shortcut window
source: Quit
pl: Wyjdź

# shortcut window
source: Player
pl: Odtwarzacz

# shortcut window
source: Open File
pl: Otwórz plik

# shortcut window
source: Pause/Play
pl: Pauza/Odtwórz

# shortcut window
source: Go back 10 seconds
pl: 10 sekund do tyłu

# shortcut window
source: Go forward 10 seconds
pl: 10 sekund do przodu

source: translator-credits
pl: polswert1

source: Unable to access dropped files
pl: Nie można odczytać pliku.

source: An unknown error happened
pl: Nieznany błąd nastąpił

source: File uses a format that cannot be played. Additional media codecs may be required.
pl: Plik używa formatu który nie może zostać odtworzony. Dodatkowe kodeki media mogą być niezbędne.

source: An error happened while trying to get information about the file. Please try again.
pl: Nieoczekiwany błąd przy odczytywaniu informacji o pliku. Spróbuj ponownie.

source: File uses an invalid URI
pl: Plik używa nieprawidłowego URI

source: Reading the file's information timed out. Please try again.
pl: Program nie mógł odczytać informacji o pliku. Spróbuj ponownie.

source: Unknown File
pl: Nieznany plik

source: The selected file doesn't contain any audio
pl: Wybrany plik nie zawiera dźwięku

source: Pause
pl: Pauza

source: Play
pl: Odtwórz

source: Audio files
pl: Pliki Audio

source: Open File
pl: Otwórz plik

source: No available audio file found
pl: Nie znaleziono dostępnego pliku audio

source: Directories Cannot Be Played
pl: Foldery nie mogą być odtwarzane

source: Please select a file.
pl: Proszę wybrać plik.

source: The selected file is not a regular file.
pl: Wybrany plik nie jest regularnym plikiem.

source: No file was selected
pl: Plik nie został wybrany
